package main

import (
	"fmt"
	"net"
	"os"
)

func sender(conn net.Conn) {
	words := "中哈发生的鬼地方施工图第三个范德萨干豆腐花打工皇帝繁琐嘛；" +
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上"+
		"国贸大厦；方面的是；方面对方；还没答复；厉害吗；地方了还没顾得上；了国民党是；老干妈代理商；方" +
		"面sad；浪费马拉松；富马酸了；房东马上老；富马酸；浪费马上啊啊啊啊啊"
	b := []byte(words)
	conn.Write(b)
	fmt.Println("send over",len(b))

}



func main() {
	server := "127.0.0.1:8888"
	tcpAddr, err := net.ResolveTCPAddr("tcp4", server)
	if err != nil {
		fmt.Fprintf(os.Stderr, "Fatal error: %s", err.Error())
		os.Exit(1)
	}

	conn, err := net.DialTCP("tcp", nil, tcpAddr)
	if err != nil {
		fmt.Fprintf(os.Stderr, "Fatal error: %s", err.Error())
		os.Exit(1)
	}

	fmt.Println("connect success")
	sender(conn)

}